# Built In Failures Rebar Failures Rebar End Treatment Over Crank Property

Source: https://www.revitapidocs.com/2026/fb17ca85-ea42-a0cf-dfc8-4f1a44df31ca.htm

---

| Built In Failures Rebar Failures Rebar End Treatment Over Crank Property |
| --- |

Cannot add end treatment to the end that already has a crank.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId RebarEndTreatmentOverCrank { get; }
```

```
Public Shared ReadOnly Property RebarEndTreatmentOverCrank As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ RebarEndTreatmentOverCrank {
	FailureDefinitionId^ get ();
}
```

```
static member RebarEndTreatmentOverCrank : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures RebarFailures Class Autodesk.Revit.DB Namespace